; domain
; Guy - ECE final project vB2
; minimizes total length of all the robots based on the length of
; each action. this means that we need to encode the path length
; of each combination (loc(i)->loc(j), loc(j)->loc(i) for all connected i,j) in the task file.
; it does not take into any account the reactive nature which might elongate the path.
; encode unconnected two points with a ridiculously large cost.

(define (domain auto_warehouse)

;; Defining options for the planning system
(:requirements :adl :typing :action-costs)

;; Defining types
(:types
  forklift_a forklift_b - agent
  nodes - location
  pallet_a pallet_b - pallet
  pallet agent - physobj
  physobj operation location - object
  )

; just dummy for stopping
(:constants
      stop - operation
  )
(:functions
    (distance ?from ?to)
    (total-cost)
  )
(:predicates
    ;location of a robot or package. Either initial, pickup or dropoff
    (at ?obj - physobj ?loc - location)
    ;is a certain pallet on a certain robot?
    (on ?pkg - pallet ?robot - agent)
    ;can we use this forklift or this package
    (avail ?obj - physobj )
  )

;just moves the robot between places
(:action move
    :parameters (?robot - agent ?from - location ?to - location)
    :precondition (at ?robot ?from)
    :effect (and (at ?robot ?to) (not (at ?robot ?from)) (increase (total-cost) (distance ?from ?to)))
  )
;pickup a pallet if robot is at the location of the pallet and it's capacity
;is allowing
(:action load
    :parameters (?robot - agent ?unit - pallet ?loc - location)
    :precondition (and (avail ?robot) (avail ?unit)
                       (at ?robot ?loc) (at ?unit ?loc ) )
    :effect (and (not (avail ?unit)) (not (avail ?robot))
                 (on ?unit ?robot) (not (at ?unit ?loc ))
                 (increase (total-cost) 1))
  )

(:action unload
    :parameters   (?robot - agent ?unit - pallet ?loc - location)
    :precondition (and (at ?robot ?loc) (on ?unit ?robot) )
    :effect       (and (not (on ?unit ?robot)) (at ?unit ?loc) (avail ?robot)
                  (increase (total-cost) 1))
  )
)

; problem
(define (problem auto_warehouse_easy)
  (:domain auto_warehouse)
  (:objects
    p0 p1 p2 p3 - pallet
    robot0 robot1 - agent
    H0X9Y10 H3X2Y6 H2X10Y5 H3X5Y11 H3X2Y20 H0X6Y4 H3X5Y12 H0X10Y10 H0X10Y19 - location
  )

  (:init (= (total-cost) 0)
         (at robot0 H0X9Y10) (at robot1 H3X5Y11) 
         (avail robot0) (avail robot1) 
         (at p0 H3X5Y12) (at p1 H0X10Y10) (at p2 H0X10Y10) (at p3 H3X2Y20) 
         (avail p0) (avail p1) (avail p2) (avail p3) 
         (= (distance H0X9Y10 H0X9Y10) 0)
         (= (distance H0X9Y10 H3X2Y6) 12)
         (= (distance H3X2Y6 H0X9Y10) 6)
         (= (distance H0X9Y10 H2X10Y5) 12)
         (= (distance H2X10Y5 H0X9Y10) 6)
         (= (distance H0X9Y10 H3X5Y11) 10)
         (= (distance H3X5Y11 H0X9Y10) 4)
         (= (distance H0X9Y10 H3X2Y20) 10)
         (= (distance H3X2Y20 H0X9Y10) 5)
         (= (distance H0X9Y10 H0X6Y4) 11)
         (= (distance H0X6Y4 H0X9Y10) 5)
         (= (distance H0X9Y10 H3X5Y12) 5)
         (= (distance H3X5Y12 H0X9Y10) 3)
         (= (distance H0X9Y10 H0X10Y10) 1)
         (= (distance H0X10Y10 H0X9Y10) 1)
         (= (distance H0X9Y10 H0X10Y19) 9)
         (= (distance H0X10Y19 H0X9Y10) 9)
         (= (distance H3X2Y6 H3X2Y6) 0)
         (= (distance H3X2Y6 H2X10Y5) 12)
         (= (distance H2X10Y5 H3X2Y6) 7)
         (= (distance H3X2Y6 H3X5Y11) 12)
         (= (distance H3X5Y11 H3X2Y6) 4)
         (= (distance H3X2Y6 H3X2Y20) 14)
         (= (distance H3X2Y20 H3X2Y6) 5)
         (= (distance H3X2Y6 H0X6Y4) 3)
         (= (distance H0X6Y4 H3X2Y6) 5)
         (= (distance H3X2Y6 H3X5Y12) 13)
         (= (distance H3X5Y12 H3X2Y6) 5)
         (= (distance H3X2Y6 H0X10Y10) 7)
         (= (distance H0X10Y10 H3X2Y6) 13)
         (= (distance H3X2Y6 H0X10Y19) 7)
         (= (distance H0X10Y19 H3X2Y6) 10)
         (= (distance H2X10Y5 H2X10Y5) 0)
         (= (distance H2X10Y5 H3X5Y11) 12)
         (= (distance H3X5Y11 H2X10Y5) 9)
         (= (distance H2X10Y5 H3X2Y20) 9)
         (= (distance H3X2Y20 H2X10Y5) 12)
         (= (distance H2X10Y5 H0X6Y4) 6)
         (= (distance H0X6Y4 H2X10Y5) 9)
         (= (distance H2X10Y5 H3X5Y12) 13)
         (= (distance H3X5Y12 H2X10Y5) 10)
         (= (distance H2X10Y5 H0X10Y10) 7)
         (= (distance H0X10Y10 H2X10Y5) 13)
         (= (distance H2X10Y5 H0X10Y19) 10)
         (= (distance H0X10Y19 H2X10Y5) 16)
         (= (distance H3X5Y11 H3X5Y11) 0)
         (= (distance H3X5Y11 H3X2Y20) 16)
         (= (distance H3X2Y20 H3X5Y11) 3)
         (= (distance H3X5Y11 H0X6Y4) 4)
         (= (distance H0X6Y4 H3X5Y11) 6)
         (= (distance H3X5Y11 H3X5Y12) 1)
         (= (distance H3X5Y12 H3X5Y11) 1)
         (= (distance H3X5Y11 H0X10Y10) 2)
         (= (distance H0X10Y10 H3X5Y11) 11)
         (= (distance H3X5Y11 H0X10Y19) 11)
         (= (distance H0X10Y19 H3X5Y11) 8)
         (= (distance H3X2Y20 H3X2Y20) 0)
         (= (distance H3X2Y20 H0X6Y4) 5)
         (= (distance H0X6Y4 H3X2Y20) 10)
         (= (distance H3X2Y20 H3X5Y12) 4)
         (= (distance H3X5Y12 H3X2Y20) 15)
         (= (distance H3X2Y20 H0X10Y10) 6)
         (= (distance H0X10Y10 H3X2Y20) 11)
         (= (distance H3X2Y20 H0X10Y19) 5)
         (= (distance H0X10Y19 H3X2Y20) 14)
         (= (distance H0X6Y4 H0X6Y4) 0)
         (= (distance H0X6Y4 H3X5Y12) 7)
         (= (distance H3X5Y12 H0X6Y4) 5)
         (= (distance H0X6Y4 H0X10Y10) 6)
         (= (distance H0X10Y10 H0X6Y4) 12)
         (= (distance H0X6Y4 H0X10Y19) 6)
         (= (distance H0X10Y19 H0X6Y4) 12)
         (= (distance H3X5Y12 H3X5Y12) 0)
         (= (distance H3X5Y12 H0X10Y10) 4)
         (= (distance H0X10Y10 H3X5Y12) 6)
         (= (distance H3X5Y12 H0X10Y19) 10)
         (= (distance H0X10Y19 H3X5Y12) 10)
         (= (distance H0X10Y10 H0X10Y10) 0)
         (= (distance H0X10Y10 H0X10Y19) 10)
         (= (distance H0X10Y19 H0X10Y10) 8)
         (= (distance H0X10Y19 H0X10Y19) 0)
  )
  (:goal (and (at p0 H3X2Y6) (at p1 H2X10Y5) (at p2 H0X10Y19) (at p3 H0X6Y4) )
    )
  (:metric minimize (total-cost))
)

; plan
1. (move robot1 h3x5y11 h0x10y10)
   deleted: (at robot1 h3x5y11)
   added: (at robot1 h0x10y10)
   goals met: 0 of 4
2. (move robot0 h0x9y10 h3x5y12)
   deleted: (at robot0 h0x9y10)
   added: (at robot0 h3x5y12)
   goals met: 0 of 4
3. (load robot0 p0 h3x5y12)
   deleted: (avail p0) (avail robot0) (at p0 h3x5y12)
   added: (on p0 robot0)
   goals met: 0 of 4
4. (move robot0 h3x5y12 h3x2y6)
   deleted: (at robot0 h3x5y12)
   added: (at robot0 h3x2y6)
   goals met: 0 of 4
5. (unload robot0 p0 h3x2y6)
   deleted: (on p0 robot0)
   added: (at p0 h3x2y6) (avail robot0)
   goals met: 1 of 4
6. (move robot0 h3x2y6 h0x10y10)
   deleted: (at robot0 h3x2y6)
   added: (at robot0 h0x10y10)
   goals met: 1 of 4
7. (load robot0 p2 h0x10y10)
   deleted: (avail p2) (avail robot0) (at p2 h0x10y10)
   added: (on p2 robot0)
   goals met: 1 of 4
8. (move robot0 h0x10y10 h0x10y19)
   deleted: (at robot0 h0x10y10)
   added: (at robot0 h0x10y19)
   goals met: 1 of 4
9. (unload robot0 p2 h0x10y19)
   deleted: (on p2 robot0)
   added: (at p2 h0x10y19) (avail robot0)
   goals met: 2 of 4
10. (load robot1 p1 h0x10y10)
   deleted: (avail p1) (avail robot1) (at p1 h0x10y10)
   added: (on p1 robot1)
   goals met: 2 of 4
11. (move robot1 h0x10y10 h2x10y5)
   deleted: (at robot1 h0x10y10)
   added: (at robot1 h2x10y5)
   goals met: 2 of 4
12. (unload robot1 p1 h2x10y5)
   deleted: (on p1 robot1)
   added: (at p1 h2x10y5) (avail robot1)
   goals met: 3 of 4
13. (move robot1 h2x10y5 h3x2y20)
   deleted: (at robot1 h2x10y5)
   added: (at robot1 h3x2y20)
   goals met: 3 of 4
14. (load robot1 p3 h3x2y20)
   deleted: (avail p3) (avail robot1) (at p3 h3x2y20)
   added: (on p3 robot1)
   goals met: 3 of 4
15. (move robot1 h3x2y20 h0x6y4)
   deleted: (at robot1 h3x2y20)
   added: (at robot1 h0x6y4)
   goals met: 3 of 4
16. (unload robot1 p3 h0x6y4)
   deleted: (on p3 robot1)
   added: (at p3 h0x6y4) (avail robot1)
   goals met: 4 of 4
